{
  "users": {
    "3768": {
      "username": "BOAF",
      "posts": [
        20792,
        87835,
        39313,
        96670,
        40736
      ],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    }
  },
  "posts": {
    "20792": {
      "title": "Yeah okay so here's a wikipidea copy paste about alan turing",
      "content": "Alan Mathison Turing OBE FRS (/ˈtjʊərɪŋ/; 23 June 1912 – 7 June 1954) was an English[6] mathematician, computer scientist, logician, cryptanalyst, philosopher and theoretical biologist.[7] Turing was highly influential in the development of theoretical computer science, providing a formalisation of the concepts of algorithm and computation with the Turing machine, which can be considered a model of a general-purpose computer.[8][9][10] Turing is widely considered to be the father of theoretical computer science and artificial intelligence.[11] Despite these accomplishments, he was not fully recognised in his home country during his lifetime, due to his homosexuality, and because much of his work was covered by the Official Secrets Act.\n\nDuring the Second World War, Turing worked for the Government Code and Cypher School (GC&CS) at Bletchley Park, Britain's codebreaking centre that produced Ultra intelligence. For a time he led Hut 8, the section that was responsible for German naval cryptanalysis. Here, he devised a number of techniques for speeding the breaking of German ciphers, including improvements to the pre-war Polish bombe method, an electromechanical machine that could find settings for the Enigma machine.\n\nTuring played a pivotal role in cracking intercepted coded messages that enabled the Allies to defeat the Nazis in many crucial engagements, including the Battle of the Atlantic, and in so doing helped win the war.[12][13] Due to the problems of counterfactual history, it's hard to estimate what effect Ultra intelligence had on the war,[14] but at the upper end it has been estimated that this work shortened the war in Europe by more than two years and saved over 14 million lives.[12]\n\nAfter the war, Turing worked at the National Physical Laboratory, where he designed the Automatic Computing Engine, which was one of the first designs for a stored-program computer. In 1948, Turing joined Max Newman's Computing Machine Laboratory at the Victoria University of Manchester, where he helped develop the Manchester computers[15] and became interested in mathematical biology. He wrote a paper on the chemical basis of morphogenesis[1] and predicted oscillating chemical reactions such as the Belousov–Zhabotinsky reaction, first observed in the 1960s.\n\nTuring was prosecuted in 1952 for homosexual acts; the Labouchere Amendment of 1885 had mandated that \"gross indecency\" was a criminal offence in the UK. He accepted chemical castration treatment, with DES, as an alternative to prison. Turing died in 1954, 16 days before his 42nd birthday, from cyanide poisoning. An inquest determined his death as a suicide, but it has been noted that the known evidence is also consistent with accidental poisoning.\n\nIn 2009, following an Internet campaign, British Prime Minister Gordon Brown made an official public apology on behalf of the British government for \"the appalling way he was treated\". Queen Elizabeth II granted Turing a posthumous pardon in 2013. The Alan Turing law is now an informal term for a 2017 law in the United Kingdom that retroactively pardoned men cautioned or convicted under historical legislation that outlawed homosexual acts.[16]\n\nIn July 2019, the Bank of England announced that Turing would be depicted on the United Kingdom's new £50 note.",
      "author": "3768",
      "date": "Wed Dec 11 2019 22:14:21 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "20792"
    },
    "39313": {
      "title": "Man After Man",
      "content": "Man After Man: An Anthropology of the Future is a 1990 speculative evolution book written by Scottish geologist Dougal Dixon and illustrated by Philip Hood. The book also features a foreword by Brian Aldiss. Man After Man explores a hypothetical future path of human evolution set from 200 years in the future to 5 million years in the future, with several future human species evolving through genetic engineering and natural means through the course of the book.[1]\n\nMan After Man is Dixon's third work on speculative evolution, following After Man (1981), which explored the animals of a hypothetical world 50 million years in the future where humanity had gone extinct, and The New Dinosaurs (1988), which explored the animals of a world where the Cretaceous-Paleogene extinction event never occurred. Unlike the previous two books, which were written much like field guides and explored factual natural processes through fictional examples and worlds, the focus of Man After Man lies much on the individual perspectives of future human individuals of various species, mainly focused on how they perceive the changing climate, which they are specifically engineered to be adapted to, around themselves.\n\nThough reviews of the book were generally positive, they criticised the science aspect of the book in a greater extent than in its predecessors, finding parts of the book unlikely. Dixon himself is not fond of the book, referring to it as a \"disaster of a project\". During writing, the book had changed considerably from its initial concept, which instead would have involved modern humans time-travelling to the future world of After Man and subsequently devastating the future ecosystem. This idea was later repurposed into Dixon's 2010 book Greenworld, which applies it to a fictional alien ecosystem, so far only published in Japan.",
      "author": "3768",
      "date": "Wed Dec 11 2019 22:16:24 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "39313"
    },
    "40736": {
      "title": "Just Some Random Facts",
      "content": "kay, technically she wasn't his pet, but after his tour of the Galapagos Islands, Charles Darwin brought back a five-year-old tortoise he named Harriet. She outlived her adopter by 124 years, ultimately making it to a whopping 176 years old. Harriet lived out her final years as part of the family of Steve \"Crocodile Hunter\" Irwin in Australia, until she passed away, in 2006. And for fascinating info straight from the animal kingdom, don't miss the 50 Most Amazing Animal Facts!\n\n2The average person will spend six months of their life waiting for red lights to turn green\ntraffic red lights\n\nDriving can be a fun and liberating activity—until you get stuck at a red light, that is. The National Association of City Transportation Officials says that the average time spent waiting at a red light is 75 seconds, accounting for approximately 20 percent of all driving time. That's a whole lot of time doing nothing and just another reason to switch to public transportation.  \n\n3A bolt of lightning contains enough energy to toast 100,000 slices of bread\nLightning Storm Bogus 20th Century Facts\n\nIf you consider that each bolt of lightning contains more than 5 billion Joules of energy, then the average 1000-watt, two-slice toaster could be powered for 84,000 minutes with just one strike. That's just enough time to toast about 100,000 slices of bread, bagels, English muffins—whatever you prefer.\n\n4Cherophobia is the word for the irrational fear of being happy\nwoman holding a smile face against a pink background\nShutterstock\nNo, it's not the fear of Cher, as the name might lead you to believe. It comes from the Greek word \"chero,\" which means \"to rejoice.\" People who suffer from cherophobia are often afraid, cripplingly so, of doing anything that might lead to happiness. This includes doing fun activities and rejecting opportunities that may lead to positive outcomes. This form of anxiety disorder should be treated with medicine much stronger than laughter: love (and therapy).",
      "author": "3768",
      "date": "Wed Dec 11 2019 22:17:18 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "40736"
    },
    "87835": {
      "title": "Assignment 9 ",
      "content": "Are u really kidding me? why the TA changed the requirements of assignment 9. The reply and retweet button was extra credit before. Thanks to one of my friend told me that. \n\ni know wtf\n\n \n\nedit: good friend tho",
      "author": "3768",
      "date": "Wed Dec 11 2019 22:15:39 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "87835"
    },
    "96670": {
      "title": "UNC Stuff",
      "content": "The University of North Carolina at Chapel Hill (UNC, UNC-Chapel Hill, North Carolina, Chapel Hill, or simply Carolina[12]) is a public research university in Chapel Hill, North Carolina. It is the flagship of the 17 campuses of the University of North Carolina system. After being chartered in 1789, the university first began enrolling students in 1795, which also allows it to be one of three schools to claim the title of the oldest public university in the United States. Among the claimants, the University of North Carolina at Chapel Hill is the only one to have held classes and graduated students as a public university in the eighteenth century.[13]\n\nThe first public institution of higher education in North Carolina, the school opened its doors to students on February 12, 1795. The university offers degrees in over 70 courses of study through fourteen colleges and the College of Arts and Sciences. All undergraduates receive a liberal arts education and have the option to pursue a major within the professional schools of the university or within the College of Arts and Sciences from the time they obtain junior status. Under the leadership of President Kemp Plummer Battle, in 1877 North Carolina became coeducational and began the process of desegregation in 1951 when African-American graduate students were admitted under Chancellor Robert Burton House.[14][15] In 1952, North Carolina opened its own hospital, UNC Health Care, for research and treatment, and has since specialized in cancer care. The school's students, alumni, and sports teams are known as \"Tar Heels\".\n\nUNC's faculty and alumni include 9 Nobel Prize laureates, 23 Pulitzer Prize winners,[16][17] and 49 Rhodes Scholars.[18] Additional notable alumni include a U.S. President,[19] a U.S. Vice President,[20] 38 Governors of U.S. States, 98 members of the United States Congress, 9 Cabinet members, 39 Henry Luce Scholars,[21] 9 World Cup winners and 3 astronauts[22][23] as well as founders and CEOs of Fortune 500 companies.\n\nThe campus covers 729 acres (3 km2) of Chapel Hill's downtown area, encompassing the Morehead Planetarium and the many stores and shops located on Franklin Street. Students can participate in over 550 officially recognized student organizations. The student-run newspaper The Daily Tar Heel has won national awards for collegiate media, while the student radio station WXYC provided the world's first internet radio broadcast. In 2018, UNC was ranked amongst the top 30 universities in the United States according to the Academic Ranking of World Universities, Washington Monthly, and U.S. News & World Report. Internationally, UNC is ranked 30th and 32nd in the world by Academic Ranking of World Universities and U.S. News and World Report, respectively.[24] UNC is regarded as a Public Ivy, a public institution which provides an academic experience equivalent to an Ivy League university. North Carolina is one of the charter members of the Atlantic Coast Conference, which was founded on June 14, 1953. Competing athletically as the Tar Heels, North Carolina has achieved great success in sports, most notably in men's basketball, women's soccer, and women's field hockey. SILENT SAM\n",
      "author": "3768",
      "date": "Wed Dec 11 2019 22:16:47 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "96670"
    }
  },
  "results": {
    "693": {
      "simmilars": [
        "20792",
        0,
        "39313",
        0,
        "40736",
        0,
        "87835",
        0,
        "96670",
        0
      ]
    },
    "9927": {
      "simmilars": [
        "20792",
        0,
        "39313",
        0,
        "40736",
        0,
        "87835",
        0,
        "96670",
        0
      ]
    }
  }
}