{
  "users": {
    "14158": {
      "username": "My Name is A tester",
      "posts": [],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "25228": {
      "username": "boaf",
      "posts": [],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "33863": {
      "username": "alksdjf",
      "posts": [],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "36208": {
      "username": "alksdjf",
      "posts": [],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "36277": {
      "username": "boaf",
      "posts": [
        13924,
        55889,
        13240
      ],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "40965": {
      "username": "nodejs",
      "posts": [],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "75100": {
      "username": "nodejs",
      "posts": [
        42801,
        74403,
        61148
      ],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "94820": {
      "username": "My Name is A tester",
      "posts": [
        53936,
        66924,
        63231,
        48237,
        68977,
        83003
      ],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    },
    "99501": {
      "username": "nodejs",
      "posts": [],
      "likedPosts": [],
      "postsCommentedOn": [],
      "numberOfLikes": 0
    }
  },
  "posts": {
    "48237": {
      "title": "Halo Reach Description",
      "content": "Halo: Reach* comes to PC as the first installment of Halo: The Master Chief Collection. Now optimized for PC, experience the heroic story of Noble Team, a group of Spartans, who through great sacrifice and courage, saved countless lives in the face of impossible odds. The planet Reach is humanity’s last line of defense between the encroaching Covenant and their ultimate goal, the destruction of Earth. If it falls, humanity will be pushed to the brink of destruction.\n\nGame Features:\n• PC Settings/Optimizations: Halo: Reach is now optimized for PC and looking better than ever at up to 4k UHD and at least 60 FPS.** Other PC native settings include mouse and keyboard support, ultrawide support, adaptive sync support, FOV customization, and more.\n• Campaign: Experience the first chapter in the Halo Saga and fight your way as Noble Six through 11 unforgettable missions\n• Multiplayer: Start your Spartan Career today with Halo: Reach’s iconic multiplayer featuring an overhauled progression system, generation-defining player customization, over 20 unforgettable maps, as well as classic game modes such as Firefight and Invasion. While Forge and Theater will be delivered later in 2020, enjoy access to millions of community-created maps and game types that have been migrated over from Halo: Reach on Xbox 360 for use today on PC.\n• Firefight: Fight alone or with squad mates to survive against endless waves of enemies deploying with ever-increasing difficulty.\n\n\n*Halo: The Master Chief Collection is required to play the (digital only) Halo: Reach.",
      "author": "94820",
      "date": "Fri Dec 06 2019 20:36:52 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "48237"
    },
    "53936": {
      "title": "Sammy Classic Sonic Fan Repost",
      "content": "THIS IS AN OUTRAGE WHYSONICWHYSONICWHYSONICWHYSONICWHYSONIC WHY SONIIIIIC. panting RRAAAAAAUUUUUUHGHGHGUGHG. STOP. HATING. ON. SONIC. FOR NO. REASOOOOOOON. Seriously, what the frick, guys? I mean, seriously. I hate all you frickin' Sonic haters! SONIC. IS NOT. A BAD FRANCHISE ANYMORE. panting Alright, we have all these FRICKIN' HYPOCRITES criti-criticizing Sonic for the l- for the LITTLEST OF REASONS. IT MAKES ME SO. MAD ERRRRGH.\n\nI mean, seriously, SONIC has improved over the years! Do you guys not realize that? I mean, seriously, WHAT THE FRICK? I mean, ohhh, because, Sonic Colors, Sonic Generations, nor Sonic 4 Episodes 1 or 2 NEVER HAPPENED! I mean, seriously, WHAT THE FRICK? I mean, come on guys! Sega has improved! Sonic is not trash anymore! I know it’s kind of hard to believe after we got that MONSTROSITY, Sonic ’06. And I don’t care what you guys say! “Ooohh, Sonic ’06 was a good game. Sonic ’06. Best Sonic game ever~” AEEEEAAAAAHHHHHHRRAAAAUUUGHGHGHGH. Idiots!\n\nAnd yet you criticize—oh, let’s bring up an example, Sonic Generations for being tisk “Too light hearted” a-a- oh! oh! “Too much 2D platforming!” Oh oh! and, that’s not all guys! Wann know why I didn’t like Sonic Generations? It’s cause it’s too childish! They need to bring Sonic back to the darker plots and they need to make him FALL IN A PILE OF GARBAGE AGAIN! RAAAAAAWWUUUHGHGHGH! NOOOOOOOOO! Nooooo! Nooo! nooo!\n\nSonic is at his best now! I KNOW he’s not what he used to be! The retro Sonic is better, alright? That’s why I’m called SammyClassicSonicFan, for crying out loud. Cause I like Retro Sonic better! See, Retro Sonic! But, that doesn’t mean modern Sonic is bad. SONIC IS SONIC! Why do you guys hate him for that? I mean, seriously! You can’t—You can’t continue hating him for A FEW BAD GAMES IN HISTORY!? Seriously, WHAT THE FRICK?\n\nAnd stop all the hatred towards, ya know, Sonic Adventure! Sonic Adventure 2! And Sonic Heroes! WHAT THE FRICK? I mean, seriously, “OH oh! Uhmm, because, uhh..the controls are a bit too hard! Oh oh, and the story-plot’s too cheesy! And the voice actors aren’t that good either…Oh oh! And they have too many characters”—SO WHAT!? I mean, I consider those games okay games. I mean, seriously, WHAT THE FRICK? I mean, seriously? What is you guys’ frickin’ problems? I respect those games cause those games, especially Sonic Adventure 1, Sonic Adventure 2, SHAPED Sonic is—into what…into what he is today! HOW CAN YOU ARGUE WITH THAT? RUUURRRRRRR!\n\nAnd, that’s not all! People say Sonic is unappealing to the eye…REALLY!? Sonic has cartoonish appeal, LOOK AT THIS! I mean, this is frickin’ adorable, you see…HOW can you go WRONG with that? Cartoonish appeal, you idiots! Seriously, WHAT THE FRICK?\n\nAnd, I mean, people are saying Sonic is a Mario ripoff. NOOOOOO! And people are saying Sonic: Lost World is a Super Mario Galaxy ripoff. You see, I put papers on my desk for decoration in my videos, and of course I’ve got some Sonic: Lost World screenshots right here, but THAT’S NOT THE FRICKIN’ POINT!! Well, it kind of is actually! People are hating on Sonic: Lost World saying it’s copying off the Super Mario Galaxy. Well SONIC, as some of you may not know, has been doing—has been running on spherical objects since Sonic 1! EVER PLAYED SCRAP BRAIN ZONE? He’s been doing it since Sonic 3 & Knuckles, ever played Death Egg!? Or Carnival Night? And that’s not all, he’s been doing it since Sonic Adventure 2, and…LEAVE HIM ALONE!! LEAVE SONIC ALONE! Okay? And...\n\nI don’t get all the hatred. Leave Sonic alone! I know Sonic isn’t what he used to be, and he probably never will be. But guess what? He’s good again! ISN’T THAT ENOUGH? rrrrrrRRRRRRRRRRAAAAWWWWWWWWWGGGGHHGHH. EEHHH. EHH. RAAAAWWWWRRRRRRrrrrrggghhhggthump thump thud RRRRRRRRRRRAAAAAAUUGHGHGH. panting LEAVE. SONIC. ALONE!\n\nSeriously, what the frick is you guys’ problems!? Saying Sonic is a terrible franchise and saying “Oh, forget Sonic, I’m playing Call of Duty”—FORGET YOUUU! FORGET YOU! Call of Duty? I have a little message to Call of Duty…do you wanna know what I think of Call of Duty? Well I’ll tell you what I think of Call of Duty…THIS! is what I THINK! of Call of Duty! eh…NEUGH! Ruh…THIS. IS WHAT. I THINK. OF CALL OF DUTY!!! Tell me. Go ahead! Tell me right now to play Call of Duty. I. will not listen to a SINGLE WORD YOU GUYS ARE SAYING! I mean seriously, WHAT THE FRICK? exasperated panting\n\nAnd…that’s not all! People are especially criticizing Sonic 4. YOU GUYS ARE THE ONES THAT CANCELLED SONIC 4: EPISODE 3. WHAT THE FRICK!? What was so bad about Sonic 4: Episode 1/Episode 2. I KNOW they weren’t as good as the classics! The classics were my first games, for crying out loud! I played the classics 10 years ago on Sonic Mega Collection, alright? When I was 5 years old! And…those games were stellar titles! Sonic 3 & Knuckles is the best SONIC GAME! But guess what!? That doesn’t. Mean. THE—NEWER GAMES ARE BAAAAAAAAAAAAAD. Newer games are still good! IDIOTS! I mean, seriously! And, Sonic 4. “Ooh, it didn’t have good enough physics! Oh, and the music was off. Oh! And the visuals were off! They need to be exactly like the classics..”GOAWAYGOAWAYGOAWAYGOAWAY! LEAVE. SONIC. ALONE! Alright? I know Sonic 4 was a—wasn’t exactly like the classics but THEY WERE GOING down the classic route! Alright? They were trying to appeal to you retro fans! But…you retro fans think it’s ALL ABOUT YOU. Alright? It’s NOT all about you! Sonic 4 was a great game. Even though I wish they could’ve picke—used the Retro Sonic..WHY DIDN’T THEY!?! Rrrrrrreugh...\n\nAnyways…that doesn't matter! You guys can’t hate on Sonic like this, you can’t pick on Sonic like this! You bullies! You trolls! GO AWAY! Leave Sonic alone! panting And…I don’t get all the hatred Sonic Colors, Sonic Generations, and Sonic: Lost World. I got Sonic Colors right here…ehh..you see, HOW CAN YOU ARGUE THAT THIS IS A BAD GAME!? “Ooh, too much 2D-2D platforming.” SHUT UP! SHUUUUUUUUUTTT UUUUUUUUUP! panting LEAVE. SONIC. ALOOOOONE! Sonic is not a bad franchise anymore! ACCEPT IT! Sonic: Lost World will blow Call of Duty: Ghosts frickin’ away. Get the frick outta here! Get the frick out of here! GET THE FRICK OOOOOOOUUUUUUUTTTTT.\n\nAlright, guys! As you all know, you see, this is what Sonic and Tails look like. You see, CARTOONISH-APPEAL. HOW CAN YOU ARGUE WITH THAT!? Rrrrugh…I mean, seriously, you call this unappealing to the eye? And all you people who criticize the Sonic games for having “Bad gameplay~ Oh, oh, and also, new lame characters, and too childish and it’s for furries!” Well GUESS WHAT I have to say to that? You all are FRICKING FRICKS!\n\nAnd, I don’t care what you guys have to say about me. MAKE. FUN OF ME all you want. You can’t shoot me down with your ARROWS OF LIES! And..guess what? I am sick of this garbage…panting\n\nHow can you guys hate on Sonic, when your little Frick-Person-Shooters ARE NO BETTER!? And…I mean, seriously, “frick Sonic! Cause…Call of Duty, Halo, BioShock, oh oh, and just to name some others. Batman: Arkham Asylum…for frickin’ fricks…is so much better than Sonic! Oh oh! Sonic does not stand a chance…you know why? Cause we have NO TASTE IN GAMING!” Well here’s what I have to say to that…you. are all. SCUM! You. are all. SCUM! You are all SCUM! SCUMMMMMMMM!\n\nAnd that’s not all, Sonic Haters!\n\nAnd guys…please just give Sonic a chance…for me? Please Sonic haters, I know it’s hard to accept that Sonic’s changed, believe me, when Sonic Colors and Sonic 4 were announced, I was a bit skeptical…but Sega has redeemed Sonic! Give Sonic a chance…please…LEAVE ME ALONE! Give Sonic a chance…STOP ALL THIS HATRED! kicks fan over and throws Pac-man ghost\n\nAnd one last thing I forgot to mention in the video! You guys treat Sonic like it’s trash, but you treat games like Halo, Call of Duty, BioShock, and et cetera et cetera et cetera, like it’s treasure. WHAT THE FRICK? I mean, seriously! I mean, you call…nnngh..like, “First person shooters” as we all know, have the same type of gameplay, same gameplay mechanics, except, OH! That’s not all! They have different plots! So that must mean all first-person shooters are revolutionary. NOOOO! They’re all the same, you guys are being cheated on , you idiots! While you guys say “Sonic isn’t revolutionary! Sonic isn’t creative!” Because, oh! A blue hedgehog who can run at the speed of sound and..platforming gameplay that spen…that blends with speed gameplay as Sonic fights against Doctor Robotnik and his army of badniks…oh, yeah, NOT CREATIVE AT ALL! Seriously, WHAT THE FRICK?\n\nYou guys need to get a frickin’ clue! STOP HATING ON SONIC! If-if-if there’s anything that you guys should be hating on, it’s FIRST-PERSON-FRICK-PERSON-STUPID-FRICKIN-DUMB-FRICKIN-IDIOT-FRICKIN-PURSE-FIRST-PERSON-SHOOTERS!! And what is with the Sonic Cycle? I mean, seriously, what the frick? The Sonic cycle is frickin’ dead! Alright? The Sonic Cycle existed last decade, but starting this decade, with Sonic Colors, Sonic 4, and Sonic Generations, the Sonic Cycle has officially been broken! It is dead! WHEN WILL YOU GUYS ACCEPT THAT!? You frickin’ fricks! Get that out of your frickin’ head that the Sonic cycle still exists! Cause it doesn’t! Alright, you idiots? Get it through your frickin’ skulls. Sonic has been redeemed! Sega has redeemed Sonic! The Sonic Cycle is DEAD! I don’t wanna hear about the Sonic Cycle, you frickin’ fricks! Get the frick out of here! What the FRICK!? This is SammyClassicSonicFan, signing out.",
      "author": "94820",
      "date": "Fri Dec 06 2019 20:34:00 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "53936"
    },
    "63231": {
      "title": "More Transformers Lore ",
      "content": "If you encounter a 'bot going by the name Sideways, do not trust him! Throughout the multiverse, the name is associated with cheats and liars. Most oftentimes, a Sideways's allegiances are to be questioned. Many of them claim to be helpful allies, but more often than not, they work for a greater evil. Some would assume Sideways to be cowardly, but their true strength oftentimes lies in their speed and their cunning. A quick getaway today can assure that greater machinations come to fruition tomorrow. Some Sideways are known to possess dimension-hopping capabilities, and tracking which Sideways is responsible for what in whatever universe can be a tad confusing. Some of them have claimed to travel to other universes to slaughter and impersonate their native counterpart, or that Sideways are cloned from one another to fulfill their roles in multiple parallel events. Sideways are true sowers of confusion, and even if one were able to see past all the lies, one would still be hard-pressed to make sense of the chaos that they leave in their wake.\n\nThe following Sideways have been documented throughout the multiverse. From one perspective, they might all be considered the same Sideways, occasionally interacting with himself via inter-dimensional shenanigans. Facts do not always line up entirely with this assertion, possibly, maybe, implying that at least some Sideways are not part of the greater agenda taking place. For the explicit sake of accessibility and to ease the conveyance of information, several Sidewayses have been documented on this wiki as though they are separate entities, even though they are frequently characterized as recurring versions of the same archetype.",
      "author": "94820",
      "date": "Fri Dec 06 2019 20:34:45 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "63231"
    },
    "66924": {
      "title": "Transformers Lore ",
      "content": "Following the conclusion of the Generations toyline's Power of the Primes subline imprint, it was refreshed with War for Cybertron: Siege branding. This new subline features a line-wide gimmick: weaponry. Deluxe and Voyager Class figures each come with at least two weapons that can combine and be placed into any C.O.M.B.A.T. System posts, 5 mm posts littered all over their bodies. Another line-wide feature are battle-damaged paintjobs to fit with the \"war\" aspect. Replacing the Prime Masters from the last toyline are \"Battle Masters\", small Targetmaster-type figures that can combine with other weapons and figures. They include additional effect pieces, called \"Fire Blasts\", that can be placed onto other weapons included with other size classes, as well as hardpoints on the figures themselves to simulate being \"shot\". Replacing Legends Class figures is the Micromaster size class, each toy consisting of a pair of figures that can combine together to become a weapon for larger figures to equip in addition to their normal robot and vehicle modes.",
      "author": "94820",
      "date": "Fri Dec 06 2019 20:34:19 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "66924"
    },
    "68977": {
      "title": "Halo 2 Description ",
      "content": "Halo 2: Anniversary* for Halo: The Master Chief Collection comes to PC looking better than ever, including up to 4K UHD resolution and HDR. Now optimized for PC with mouse and keyboard support and other native PC features.\n\n\nCelebrating Halo 2's 10-year anniversary, the iconic fan favorite returns, featuring a fully re-mastered campaign with “Classic Mode” letting you instantly switch between the re-mastered game and the original game from 2004. Explore extended cut scenes, hidden terminal videos, and utilize all new skulls to experience the campaign in a whole new way.\n\n\nPlay the game that defined online multiplayer with all 25 original multiplayer maps just as fans remember them, plus 6 completely re-imagined maps.\n\n\nHalo: The Master Chief Collection is required to play the (digital only) Halo 2: Anniversary.",
      "author": "94820",
      "date": "Fri Dec 06 2019 20:37:30 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "68977"
    },
    "83003": {
      "title": "Okay here we go again",
      "content": "Halo 2: Anniversary* for Halo: The Master Chief Collection comes to PC looking better than ever, including up to 4K UHD resolution and HDR. Now optimized for PC with mouse and keyboard support and other native PC features.\n\n\nCelebrating Halo 2's 10-year anniversary, the iconic fan favorite returns, featuring a fully re-mastered campaign with “Classic Mode” letting you instantly switch between the re-mastered game and the original game from 2004. Explore extended cut scenes, hidden terminal videos, and utilize all new skulls to experience the campaign in a whole new way.\n\n\nPlay the game that defined online multiplayer with all 25 original multiplayer maps just as fans remember them, plus 6 completely re-imagined maps.\n\n\nHalo: The Master Chief Collection is required to play the (digital only) Halo 2: Anniversary.",
      "author": "94820",
      "date": "Fri Dec 06 2019 20:42:04 GMT-0500 (Eastern Standard Time)",
      "numberOfLikes": 0,
      "comments": [],
      "usersWhoLikedThePost": [],
      "id": "83003"
    }
  },
  "results": {
    "1027": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    },
    "2396": {
      "simmilars": [
        "More Transformers Lore ",
        0,
        "Halo 2 Description ",
        0,
        "Halo Reach Description",
        0,
        "Transformers Lore ",
        0,
        "Sammy Classic Sonic Fan Repost",
        0
      ]
    },
    "2485": {
      "simmilars": [
        "Sammy Classic Sonic Fan Repost",
        0,
        "Transformers Lore ",
        0,
        "Halo Reach Description",
        0,
        "Halo 2 Description ",
        0,
        "More Transformers Lore ",
        0
      ]
    },
    "2965": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    },
    "3499": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    },
    "4151": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    },
    "4555": {
      "simmilars": [
        "Transformers Lore ",
        0,
        "More Transformers Lore ",
        0,
        "Halo 2 Description ",
        0,
        "Sammy Classic Sonic Fan Repost",
        0,
        "Halo Reach Description",
        0
      ]
    },
    "6864": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    },
    "7145": {
      "simmilars": [
        "Halo 2 Description ",
        0,
        "Halo Reach Description",
        0,
        "Sammy Classic Sonic Fan Repost",
        0,
        "More Transformers Lore ",
        0,
        "Transformers Lore ",
        0
      ]
    },
    "7665": {
      "simmilars": [
        "Halo 2 Description ",
        0,
        "Halo Reach Description",
        0,
        "Sammy Classic Sonic Fan Repost",
        0,
        "Transformers Lore ",
        0,
        "More Transformers Lore ",
        0
      ]
    },
    "9597": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    },
    "9933": {
      "simmilars": [
        "48237",
        0,
        "53936",
        0,
        "63231",
        0,
        "66924",
        0,
        "68977",
        0
      ]
    }
  }
}